# Application Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..Application Property
Document Class See Also
---
Returns the Application in which the Document resides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Application Application { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Application As Application
	Get
```

Visual C++
---
```text
public:
property Application^ Application {
	Application^ get ();
}
```

# See Also
Document Class
Autodesk.Revit.DB Namespace